//
//  HabitsConst.swift
//  MyHabits
//
//  Created by Александр Глазков on 14.01.2021.
//

import UIKit

let leadingConst8: CGFloat = 8
let trailingConst8: CGFloat = -8
let topConst8: CGFloat = 8
let bottomConst8: CGFloat = -8

let leadingConst16: CGFloat = 16
let trailingConst16: CGFloat = -16
let topConst16: CGFloat = 16
let bottomConst16: CGFloat = -16

let leadingConst22: CGFloat = 22
let trailingConst22: CGFloat = -22
let topConst22: CGFloat = 22
let bottomConst22: CGFloat = -22

let infoTitle = "Привычка за 21 день"
let infoDescription = """
Прохождение этапов, за которые за 21 день вырабатывается привычка, подчиняется следующему алгоритму:

1. Провести 1 день без обращения к старым привычкам, стараться вести себя так, как будто цель, загаданная в перспективу, находится на расстоянии шага.

2. Выдержать 2 дня в прежнем состоянии самоконтроля.

3. Отметить в дневнике первую неделю изменений и подвести первые итоги — что оказалось тяжело, что — легче, с чем еще предстоит серьезно бороться.

4. Поздравить себя с прохождением первого серьезного порога в 21 день. За это время отказ от дурных наклонностей уже примет форму осознанного преодоления и человек сможет больше работать в сторону принятия положительных качеств.

5. Держать планку 40 дней. Практикующий методику уже чувствует себя освободившимся от прошлого негатива и двигается в нужном направлении с хорошей динамикой.

6. На 90-й день соблюдения техники все лишнее из «прошлой жизни» перестает напоминать о себе, и человек, оглянувшись назад, осознает себя полностью обновившимся.

Источник: psychbook.ru
"""

let habitNameTitle = "НАЗВАНИЕ"
let habitColorTitle = "ЦВЕТ"
let habitDateTitle = "ВРЕМЯ"
